bczwartk/ST_Drone_FCU_F401/STM32 FW Project/Official release with BLE Remocon - 170318/Src/main.c
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1) {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */    
    if (0 != HCI_ProcessEvent) {
          HCI_ProcessEvent = 0;
          HCI_Process();
    }
    
    if (TRUE == set_connectable) {
          /* Now update the BLE advertize data and make the Board connectable */
          setConnectable();
          set_connectable = FALSE;
    }  
        
    if (tim9_event_flag == 1) {
      // Timer9 event: frequency 800Hz
      tim9_event_flag = 0;
          
      count1++;
           
      acc_ahrs.AXIS_X = 0.0f;
      acc_ahrs.AXIS_Y = 0.0f;
      acc_ahrs.AXIS_Z = 0.0f;
      gyro_ahrs.AXIS_X = 0.0f;
      gyro_ahrs.AXIS_Y = 0.0f;
      gyro_ahrs.AXIS_Z = 0.0f;

      for (i = 0; i < FIFO_Order; i++) {
        acc_ahrs.AXIS_X += acc_ahrs_FIFO[i].AXIS_X;
        acc_ahrs.AXIS_Y += acc_ahrs_FIFO[i].AXIS_Y;
        acc_ahrs.AXIS_Z += acc_ahrs_FIFO[i].AXIS_Z;
        gyro_ahrs.AXIS_X += gyro_ahrs_FIFO[i].AXIS_X;
        gyro_ahrs.AXIS_Y += gyro_ahrs_FIFO[i].AXIS_Y;
        gyro_ahrs.AXIS_Z += gyro_ahrs_FIFO[i].AXIS_Z;
      }

      acc_ahrs.AXIS_X *= FIFO_Order_Recip;
      acc_ahrs.AXIS_Y *= FIFO_Order_Recip;
      acc_ahrs.AXIS_Z *= FIFO_Order_Recip;
      gyro_ahrs.AXIS_X *= FIFO_Order_Recip;
      gyro_ahrs.AXIS_Y *= FIFO_Order_Recip;
      gyro_ahrs.AXIS_Z *= FIFO_Order_Recip;

      
      acc_fil_int.AXIS_X = (int32_t) acc_ahrs.AXIS_X;  
      acc_fil_int.AXIS_Y = (int32_t) acc_ahrs.AXIS_Y;  
      acc_fil_int.AXIS_Z = (int32_t) acc_ahrs.AXIS_Z;  
      gyro_fil_int.AXIS_X = (int32_t) gyro_ahrs.AXIS_X;  
      gyro_fil_int.AXIS_Y = (int32_t) gyro_ahrs.AXIS_Y;  
      gyro_fil_int.AXIS_Z = (int32_t) gyro_ahrs.AXIS_Z;  


      //PRINTF("%f %f %f %f\n", acc_ahrs.AXIS_X, acc_ahrs.AXIS_Y, gyro_ahrs.AXIS_X, gyro_ahrs.AXIS_Y);

      // AHRS update, quaternion & true gyro data are stored in ahrs
      ahrs_fusion_ag(&acc_ahrs, &gyro_ahrs, &ahrs);

      // Calculate euler angle drone
      QuaternionToEuler(&ahrs.q, &euler_ahrs);

      //BSP_LED_Toggle(LED1);
      
      #ifdef REMOCON_BLE
      
 
//          gRUD = (joydata[3]-128)*(-13);
//          gTHR = joydata[4]*13;
//          gAIL = (joydata[5]-128)*(-13);
//          gELE = (joydata[6]-128)*13;
          gRUD = (joydata[2] - 128) * (-13);
          gTHR = joydata[3] * 13;
          gAIL = (joydata[4] - 128) * (-13);
          gELE = (joydata[5] - 128) * 13;
          
          /* joydata[6]: seek bar data*/
          /* joydata[7]: additional button data
                        first bit: Takeoff (0 = Land,  1 = Takeoff)
                        second bit: Calibration When it changes status is active
                        third bit: Arming (0 = Disarmed,  1 = Armed) */
          gJoystick_status = joydata[7];
          if ((gJoystick_status & 0x04) == 0x04) {
            rc_enable_motor = 1u;
            fly_ready = 1;
            BSP_LED_On(LED2);
          } else {
            rc_enable_motor = 0u;
            fly_ready = 0;
          }

          if (TRUE == connected) {
            rc_connection_flag = 1u;                       /* BLE Remocon connected flag for enabling motor output */
            SendMotionData();
            SendBattEnvData();
            SendArmingData();            
          } else {
            rc_connection_flag = 0u;
            gTHR = 0;
            rc_enable_motor = 0u;
            fly_ready = 0;
            BSP_LED_Off(LED1);
            BSP_LED_Off(LED2);
          }
          
          if (0 != (joydata[7] & 0x02)) {
            rc_cal_flag = 1;
            BSP_LED_On(LED1);
          }
      #endif
          
      #ifdef REMOCON_PWM
          if ( (gTHR == 0) && (gELE < - RC_CAL_THRESHOLD) && (gAIL > RC_CAL_THRESHOLD) && (gRUD < - RC_CAL_THRESHOLD))
          {
            rc_cal_flag = 1;
            BSP_LED_On(LED1);
          }
           
      
          if ( (gTHR == 0) && (gELE < - RC_CAL_THRESHOLD) && (gAIL < - RC_CAL_THRESHOLD) && (gRUD > RC_CAL_THRESHOLD))
          {
            rc_enable_motor = 1;
            fly_ready = 1;
            BSP_LED_On(LED2);          
          }
      #endif
      
      // Get target euler angle from remote control
      GetTargetEulerAngle(&euler_rc, &euler_ahrs);
          
      if (gTHR < MIN_THR) {
        euler_ahrs_offset.thx = 0.0f;
        euler_ahrs_offset.thy = 0.0f;
      }

      Fly_origin.X_Degree = (int16_t)(euler_ahrs.thx * 5730.0f);
      Fly_origin.Y_Degree = (int16_t)(euler_ahrs.thy * 5730.0f);
      Fly_origin.Z_Degree = (int16_t)(euler_ahrs.thz * 5730.0f);


      if (gTHR < MIN_THR) {
        euler_rc.thz = 0.0f;
        euler_ahrs.thz = 0.0f;
      }

      euler_rc_fil.thx = euler_rc.thx;
      euler_rc_fil.thy = euler_rc.thy;
      euler_rc_fil.thz = euler_rc.thz;
      
      FlightControlPID_OuterLoop(&euler_rc_fil, &euler_ahrs, &pid);
      
    /* Added for debug on UART*/
    /* Remocon ELE, AIL, RUD, THR, AHRS Euler angle x and y axis, Remocon Euler angle x and y axis */
    //PRINTF("%d\t%d\t%d\t%d\t%f\t%f\t%f\t%f\n", gELE, gAIL, gRUD, gTHR, euler_ahrs.thx * 57.3f, euler_ahrs.thy * 57.3f, euler_rc.thx * 57.3f, euler_rc.thy * 57.3f);
    /* Remocon ELE, AIL, RUD, THR, Motor1_pwm, AHRS Euler angle x and y axis */
    //PRINTF("%d\t%d\t%d\t%d\t%f\t%f\t%f\t%f\t%f\n", gELE, gAIL, gRUD, gTHR, motor_pwm.motor1_pwm, euler_ahrs.thx * 57.3f, euler_ahrs.thy * 57.3f, euler_rc.thx * 57.3f, euler_rc.thy * 57.3f);
    //PRINTF("%d\t%d\t%d\t%d\n", gELE, gAIL, gRUD, gTHR);
    /* Remocon THR, Acc and Gyro FIFO data x and y axis, AHRS Euler angle x and y axis, Remocon Euler angle x and y axis*/
    //PRINTF("%d\t%f\t%f\t%f\t%f\t%f\t%f\t%f\t%f\n", gTHR, acc_ahrs.AXIS_X, acc_ahrs.AXIS_Y, gyro_ahrs.AXIS_X, gyro_ahrs.AXIS_Y, euler_ahrs.thx * 57.3f, euler_ahrs.thy * 57.3f, euler_rc.thx * 57.3f, euler_rc.thy * 57.3f);
    /* MEMS Accelerometer RAW data */
    //PRINTF("%d\t%d\t%d\t\n", acc.AXIS_X, acc.AXIS_Y, acc.AXIS_Z);
      
