bczwartk/ST_Drone_FCU_F401/STM32 FW Project/Official release with BLE Remocon - 170318/Src/main.c
  sConfigOC.OCMode = TIM_OCMODE_PWM1;
  sConfigOC.Pulse = 0;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
  (void)HAL_TIM_PWM_ConfigChannel(&htim4, &sConfigOC, TIM_CHANNEL_1);

  (void)HAL_TIM_PWM_ConfigChannel(&htim4, &sConfigOC, TIM_CHANNEL_2);

  (void)HAL_TIM_PWM_ConfigChannel(&htim4, &sConfigOC, TIM_CHANNEL_3);

  (void)HAL_TIM_PWM_ConfigChannel(&htim4, &sConfigOC, TIM_CHANNEL_4);

}

/* TIM9 init function */
static void MX_TIM9_Init(void)
{
  TIM_ClockConfigTypeDef sClockSourceConfig;

  htim9.Instance = TIM9;
  htim9.Init.Prescaler = 51;
  htim9.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim9.Init.Period = 1999;
  htim9.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  (void)HAL_TIM_Base_Init(&htim9);

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  (void)HAL_TIM_ConfigClockSource(&htim9, &sClockSourceConfig);
}

/* USART1 init function */
static void MX_USART1_UART_Init(void)
{
  huart1.Instance = USART1;
  huart1.Init.BaudRate = 115200;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX_RX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;
  (void)HAL_UART_Init(&huart1);
}

/** Configure pins as
        * Analog
        * Input
        * Output
        * EVENT_OUT
        * EXTI
        * Free pins are configured automatically as Analog (this feature is enabled through
        * the Code Generation settings)
*/
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __GPIOC_CLK_ENABLE();
  __GPIOA_CLK_ENABLE();
  __GPIOB_CLK_ENABLE();

  /*Configure GPIO pins : PB4 PB5 */
  GPIO_InitStruct.Pin = GPIO_PIN_4|GPIO_PIN_5;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
/*
 *  Handle Timer9 interrupt @ 800Hz
 *  Set the event flag and increase time index
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  if (sensor_init_cali == 0) {
    sensor_init_cali_count++;

    if (sensor_init_cali_count > 800) {
      // Read sensor data and prepare for specific coodinate system
      ReadSensorRawData(LSM6DSL_X_0_handle, LSM6DSL_G_0_handle, LIS2MDL_M_0_handle, LPS22HB_P_0_handle, &acc, &gyro, &mag, &press);

      acc_off_calc.AXIS_X += acc.AXIS_X;
      acc_off_calc.AXIS_Y += acc.AXIS_Y;
      acc_off_calc.AXIS_Z += acc.AXIS_Z;

      gyro_off_calc.AXIS_X += gyro.AXIS_X;
      gyro_off_calc.AXIS_Y += gyro.AXIS_Y;
      gyro_off_calc.AXIS_Z += gyro.AXIS_Z;

      if (sensor_init_cali_count >= 1600) {
        acc_offset.AXIS_X = (int32_t) (acc_off_calc.AXIS_X * 0.00125f);
        acc_offset.AXIS_Y = (int32_t) (acc_off_calc.AXIS_Y * 0.00125f);
        acc_offset.AXIS_Z = (int32_t) (acc_off_calc.AXIS_Z * 0.00125f);

        gyro_offset.AXIS_X = (int32_t) (gyro_off_calc.AXIS_X * 0.00125f);
        gyro_offset.AXIS_Y = (int32_t) (gyro_off_calc.AXIS_Y * 0.00125f);
        gyro_offset.AXIS_Z = (int32_t) (gyro_off_calc.AXIS_Z * 0.00125f);

        acc_off_calc.AXIS_X = 0;
        acc_off_calc.AXIS_Y = 0;
        acc_off_calc.AXIS_Z = 0;
        gyro_off_calc.AXIS_X = 0;
        gyro_off_calc.AXIS_Y = 0;
        gyro_off_calc.AXIS_Z = 0;

        sensor_init_cali_count = 0;
        sensor_init_cali = 1;
      }
    }
  }

  if (sensor_init_cali == 1) {
    tim9_cnt++;
    tim9_cnt2++;

    // Read sensor data and prepare for specific coodinate system
    ReadSensorRawData(LSM6DSL_X_0_handle, LSM6DSL_G_0_handle, LIS2MDL_M_0_handle, LPS22HB_P_0_handle, &acc, &gyro, &mag, &press);
    
    if (rc_cal_flag == 1) {
      acc_off_calc.AXIS_X += acc.AXIS_X;
      acc_off_calc.AXIS_Y += acc.AXIS_Y;
      acc_off_calc.AXIS_Z += acc.AXIS_Z;

      gyro_off_calc.AXIS_X += gyro.AXIS_X;
      gyro_off_calc.AXIS_Y += gyro.AXIS_Y;
      gyro_off_calc.AXIS_Z += gyro.AXIS_Z;

      rc_cal_cnt++;

      if (rc_cal_cnt >= 800) {
        acc_offset.AXIS_X = (int32_t) (acc_off_calc.AXIS_X * 0.00125f);
        acc_offset.AXIS_Y = (int32_t) (acc_off_calc.AXIS_Y * 0.00125f);
        acc_offset.AXIS_Z = (int32_t) (acc_off_calc.AXIS_Z * 0.00125f);

        gyro_offset.AXIS_X = (int32_t) (gyro_off_calc.AXIS_X * 0.00125f);
        gyro_offset.AXIS_Y = (int32_t) (gyro_off_calc.AXIS_Y * 0.00125f);
        gyro_offset.AXIS_Z = (int32_t) (gyro_off_calc.AXIS_Z * 0.00125f);

        acc_off_calc.AXIS_X = 0;
        acc_off_calc.AXIS_Y = 0;
        acc_off_calc.AXIS_Z = 0;
        gyro_off_calc.AXIS_X = 0;
        gyro_off_calc.AXIS_Y = 0;
        gyro_off_calc.AXIS_Z = 0;

        rc_cal_cnt = 0;
        rc_cal_flag = 0;
      }
    }

    acc.AXIS_X -= acc_offset.AXIS_X;
    acc.AXIS_Y -= acc_offset.AXIS_Y;
    acc.AXIS_Z -= (acc_offset.AXIS_Z - 1000);
    gyro.AXIS_X -= gyro_offset.AXIS_X;
    gyro.AXIS_Y -= gyro_offset.AXIS_Y;
    gyro.AXIS_Z -= gyro_offset.AXIS_Z;

    // Save filtered data to acc_FIFO
    acc_FIFO[tim9_cnt2 - 1u].AXIS_X = acc.AXIS_X;
    acc_FIFO[tim9_cnt2 - 1u].AXIS_Y = acc.AXIS_Y;
    acc_FIFO[tim9_cnt2 - 1u].AXIS_Z = acc.AXIS_Z;

    // IIR Filtering on gyro
    gyro_fil.AXIS_X = (gyro_fil_coeff.b0 * gyro.AXIS_X) + (gyro_fil_coeff.b1 * gyro_x_pre[0].AXIS_X) + (gyro_fil_coeff.b2 * gyro_x_pre[1].AXIS_X)
                                                    + (gyro_fil_coeff.a1 * gyro_y_pre[0].AXIS_X) + (gyro_fil_coeff.a2 * gyro_y_pre[1].AXIS_X);
    gyro_fil.AXIS_Y = (gyro_fil_coeff.b0 * gyro.AXIS_Y) + (gyro_fil_coeff.b1 * gyro_x_pre[0].AXIS_Y) + (gyro_fil_coeff.b2 * gyro_x_pre[1].AXIS_Y)
                                                    + (gyro_fil_coeff.a1 * gyro_y_pre[0].AXIS_Y) + (gyro_fil_coeff.a2 * gyro_y_pre[1].AXIS_Y);
    gyro_fil.AXIS_Z = (gyro_fil_coeff.b0 * gyro.AXIS_Z) + (gyro_fil_coeff.b1 * gyro_x_pre[0].AXIS_Z) + (gyro_fil_coeff.b2 * gyro_x_pre[1].AXIS_Z)
                                                    + (gyro_fil_coeff.a1 * gyro_y_pre[0].AXIS_Z) + (gyro_fil_coeff.a2 * gyro_y_pre[1].AXIS_Z);
    // Shift IIR filter state
    for (int32_t i = 1; i > 0; i--) {
      gyro_x_pre[i].AXIS_X = gyro_x_pre[i - 1].AXIS_X;
      gyro_x_pre[i].AXIS_Y = gyro_x_pre[i - 1].AXIS_Y;
      gyro_x_pre[i].AXIS_Z = gyro_x_pre[i - 1].AXIS_Z;
      gyro_y_pre[i].AXIS_X = gyro_y_pre[i - 1].AXIS_X;
      gyro_y_pre[i].AXIS_Y = gyro_y_pre[i - 1].AXIS_Y;
      gyro_y_pre[i].AXIS_Z = gyro_y_pre[i - 1].AXIS_Z;
    }
    gyro_x_pre[0].AXIS_X = gyro.AXIS_X;
    gyro_x_pre[0].AXIS_Y = gyro.AXIS_Y;
    gyro_x_pre[0].AXIS_Z = gyro.AXIS_Z;
    gyro_y_pre[0].AXIS_X = gyro_fil.AXIS_X;
    gyro_y_pre[0].AXIS_Y = gyro_fil.AXIS_Y;
    gyro_y_pre[0].AXIS_Z = gyro_fil.AXIS_Z;

    //  Save filtered data to gyro_FIFO
    gyro_FIFO[tim9_cnt2 - 1u].AXIS_X = gyro_fil.AXIS_X;
    gyro_FIFO[tim9_cnt2 - 1u].AXIS_Y = gyro_fil.AXIS_Y;
    gyro_FIFO[tim9_cnt2 - 1u].AXIS_Z = gyro_fil.AXIS_Z;
    

    if (tim9_cnt2 == FIFO_Order) {
      tim9_cnt2 = 0u;
      tim9_event_flag = 1u;
      for (int32_t i = 0; i < FIFO_Order; i++) {
        acc_ahrs_FIFO[i].AXIS_X = acc_FIFO[i].AXIS_X;
        acc_ahrs_FIFO[i].AXIS_Y = acc_FIFO[i].AXIS_Y;
        acc_ahrs_FIFO[i].AXIS_Z = acc_FIFO[i].AXIS_Z;
        gyro_ahrs_FIFO[i].AXIS_X = gyro_FIFO[i].AXIS_X;
        gyro_ahrs_FIFO[i].AXIS_Y = gyro_FIFO[i].AXIS_Y;
        gyro_ahrs_FIFO[i].AXIS_Z = gyro_FIFO[i].AXIS_Z;
      }
    }

      
    gyro_in_rad.gx = ((float32_t)gyro_fil.AXIS_X) * ((float32_t)COE_MDPS_TO_RADPS);
    gyro_in_rad.gy = ((float32_t)gyro_fil.AXIS_Y) * ((float32_t)COE_MDPS_TO_RADPS);
    gyro_in_rad.gz = ((float32_t)gyro_fil.AXIS_Z) * ((float32_t)COE_MDPS_TO_RADPS);

