bczwartk/ST_Drone_FCU_F401/STM32 FW Project/Official release with BLE Remocon - 170318/Src/main.c
      euler_ahrs.thz += gyro_in_rad.gz * PID_SAMPLING_TIME;

      if (gTHR < MIN_THR) {
        euler_rc.thz = 0.0f;
        euler_ahrs.thz = 0.0f;
      }

      if ((rc_connection_flag != 0u) && (rc_enable_motor != 0u)) {
    	// Do PID Control
        FlightControlPID_innerLoop(&gyro_in_rad, &pid, &motor_pwm);
      } else {
        // set motor output zero
        set_motor_pwm_zero(&motor_pwm);
      }

      if (gTHR < MIN_THR) {
        set_motor_pwm_zero(&motor_pwm);
      }

      set_motor_pwm(&motor_pwm);      /* To comment if want to debug remocon calibration switching off the motors */
  }
}


/**
* @brief  Initialize all sensors
* @param  None
* @retval None
*/
static void initializeAllSensors( void )
{
  if (BSP_ACCELERO_Init( LSM6DSL_X_0, &LSM6DSL_X_0_handle ) != COMPONENT_OK) {
    while (1) {}
  }
  
  if (BSP_GYRO_Init( LSM6DSL_G_0, &LSM6DSL_G_0_handle ) != COMPONENT_OK) {
    while (1) {}
  }
  
  if (BSP_MAGNETO_Init( LIS2MDL_M_0, &LIS2MDL_M_0_handle ) != COMPONENT_OK) {
    while (1) {}
  }
  
  if (BSP_PRESSURE_Init( LPS22HB_P_0, &LPS22HB_P_0_handle ) != COMPONENT_OK) {
    while (1) {}
  }

  if (BSP_TEMPERATURE_Init( LPS22HB_T_0, &LPS22HB_T_0_handle ) != COMPONENT_OK) {
    while (1) {}
  }
}

/**
* @brief  Enable all sensors
* @param  None
* @retval None
*/
static void enableAllSensors( void )
{
  (void)BSP_ACCELERO_Sensor_Enable( LSM6DSL_X_0_handle );
  (void)PRINTF("LSM6DSL MEMS Accelerometer initialized and enabled\n");
  (void)BSP_GYRO_Sensor_Enable( LSM6DSL_G_0_handle );
  (void)PRINTF("LSM6DSL MEMS Gyroscope initialized and enabled\n");
  (void)BSP_MAGNETO_Sensor_Enable( LIS2MDL_M_0_handle );
  (void)PRINTF("LIS2MDL Magnetometer initialized and enabled\n");
  (void)BSP_PRESSURE_Sensor_Enable( LPS22HB_P_0_handle );
  (void)PRINTF("LPS22HB Pressure sensor initialized and enabled\n");
  (void)BSP_TEMPERATURE_Sensor_Enable( LPS22HB_T_0_handle );
  (void)PRINTF("LPS22HB Temperature sensor initialized and enabled\n");
}



static void BlueNRG_Init(void)
{
  
  int32_t ret = 1;
  uint8_t  hwVersion = 0u;
  uint16_t fwVersion = 0u;
  
  PRINTF("****** START BLE TESTS ******\r\n");
  BNRG_SPI_Init();

  uint8_t tmp_bdaddr[6] = {MAC_BLUEMS};
  int32_t i;
  for(i = 0; i < 6; i++) {
    bdaddr[i] = tmp_bdaddr[i];
  }
  
  /* Initialize the BlueNRG HCI */
  HCI_Init();
    
 /* Reset BlueNRG hardware */
  BlueNRG_RST();
  
  /* get the BlueNRG HW and FW versions */
  PRINTF("\r\nReading BlueNRG version ...\r\n");
  if (getBlueNRGVersion(&hwVersion, &fwVersion) == BLE_STATUS_SUCCESS) {
    
    /* 
     * Reset BlueNRG again otherwise it will fail.
     */
    BlueNRG_RST();
    
    PRINTF("Setting Pubblic Address...\r\n");
    ret = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
                                    CONFIG_DATA_PUBADDR_LEN,
                                    bdaddr);
    if (0 != ret) {
      testStatus = COMPONENT_ERROR;
      PRINTF("\r\nSetting Pubblic BD_ADDR failed *****\r\n");
      goto fail;
    }
    
    PRINTF("GATT Initializzation...\r\n");
    ret = aci_gatt_init();    
    if (0 !=  ret) {
      testStatus = COMPONENT_ERROR;
      PRINTF("\r\nGATT_Init failed ****\r\n");
      goto fail;
    }

//    ret = aci_gatt_update_char_value(service_handle, dev_name_char_handle, 0,
//                                     7/*strlen(BoardName)*/, (uint8_t *)BoardName);
//  
//    if(ret){
//       PRINTF("\r\naci_gatt_update_char_value failed\r\n");
//      while(1);
//    }
    
    /* Set the GAP INIT like X-NUCLEO-IDB05A1 eval board  since using same SPBTLE_RF module*/
    ret = aci_gap_init_IDB05A1(GAP_PERIPHERAL_ROLE_IDB05A1, 0, 0x07, &service_handle, &dev_name_char_handle, &appearance_char_handle);
  
    if (ret != BLE_STATUS_SUCCESS) {
      PRINTF("\r\nGAP_Init failed\r\n");
      goto fail;
    }
    
    PRINTF("GAP setting Authentication ....\r\n");
    ret = aci_gap_set_auth_requirement(MITM_PROTECTION_REQUIRED,
                                       OOB_AUTH_DATA_ABSENT,
                                       NULL, 7, 16,
                                       USE_FIXED_PIN_FOR_PAIRING, 123456,
                                       BONDING);
    if (ret != BLE_STATUS_SUCCESS) {
      testStatus = COMPONENT_ERROR;
       PRINTF("\r\nGAP setting Authentication failed ******\r\n");
       goto fail;
    }

    PRINTF("SERVER: BLE Stack Initialized \r\n"
           "Board HWver=%d, FWver=%d.%d.%c\r\n"
           "BoardMAC = %x:%x:%x:%x:%x:%x\r\n",
           hwVersion,
           fwVersion>>8,
           (fwVersion>>4)&0xF,
           (hwVersion > 0x30) ? ('a'+(fwVersion&0xF)-1) : 'a',
           bdaddr[5],bdaddr[4],bdaddr[3],bdaddr[2],bdaddr[1],bdaddr[0]);

    /* Set output power level */
    (void)aci_hal_set_tx_power_level(1, 4);    /* -2.1dBm */
    
    ret = Add_ConsoleW2ST_Service();
    if (ret == BLE_STATUS_SUCCESS) {
       PRINTF("Console Service W2ST added successfully\r\n");
    } else {
       testStatus = COMPONENT_ERROR;
       PRINTF("\r\nError while adding Console Service W2ST\r\n");
    }
    
    ret = Add_ConfigW2ST_Service();
    if (ret == BLE_STATUS_SUCCESS) {
       PRINTF("Config  Service W2ST added successfully\r\n");
    } else {
       testStatus = COMPONENT_ERROR;
       PRINTF("\r\nError while adding Config Service W2ST\r\n");
    }
    
    PRINTF("\r\nAll test passed!\r\n");
  } else {
       testStatus = COMPONENT_ERROR;
       PRINTF("\r\nError in BlueNRG tests. ******\r\n");
  }
  PRINTF("****** END BLE TESTS ******\r\n");
  return;

fail:
  testStatus = COMPONENT_ERROR;
  return;
}

/** @brief Initialize all the Custom BlueNRG services
 * @param None
 * @retval None
 */
static void Init_BlueNRG_Custom_Services(void)
{
  tBleStatus ret;
  
  ret = Add_HWServW2ST_Service();
  if (ret == BLE_STATUS_SUCCESS) {
     PRINTF("HW      Service W2ST added successfully\r\n");
  } else {
     PRINTF("\r\nError while adding HW Service W2ST\r\n");
  }

  ret = Add_ConsoleW2ST_Service();
  if (ret == BLE_STATUS_SUCCESS) {
     PRINTF("Console Service W2ST added successfully\r\n");
  } else {
     PRINTF("\r\nError while adding Console Service W2ST\r\n");
  }

