bczwartk/ST_Drone_FCU_F401/STM32 FW Project/Official release with BLE Remocon - 170318/Src/main.c
  ret = Add_ConfigW2ST_Service();
  if (ret == BLE_STATUS_SUCCESS) {
     PRINTF("Config  Service W2ST added successfully\r\n");
  } else {
     PRINTF("\r\nError while adding Config Service W2ST\r\n");
  }
}

/**
  * @brief  Send Motion Data Acc/Mag/Gyro to BLE
  * @param  None
  * @retval None
  */
static void SendMotionData(void)
{
  SensorAxes_t ACC_Value;
  SensorAxes_t GYR_Value;
  SensorAxes_t MAG_Value;
  
  ACC_Value.AXIS_X = acc.AXIS_X;
  ACC_Value.AXIS_Y = acc.AXIS_Y;
  ACC_Value.AXIS_Z = acc.AXIS_Z;
  GYR_Value.AXIS_X = gyro.AXIS_X;
  GYR_Value.AXIS_Y = gyro.AXIS_Y;
  GYR_Value.AXIS_Z = gyro.AXIS_Z;
  MAG_Value.AXIS_X = mag.AXIS_X;
  MAG_Value.AXIS_Y = mag.AXIS_Y;
  MAG_Value.AXIS_Z = mag.AXIS_Z;

  /*Debug */
  //PRINTF("ACC[X, Y, Z]: %d\t%d\t%d\t\n", ACC_Value.AXIS_X, ACC_Value.AXIS_Y, ACC_Value.AXIS_Z);
  //PRINTF("GYRO[X, Y, Z]: %d\t%d\t%d\t\n", GYR_Value.AXIS_X, GYR_Value.AXIS_Y, GYR_Value.AXIS_Z);
  //PRINTF("MAG[X, Y, Z]: %d\t%d\t%d\t\n", MAG_Value.AXIS_X, MAG_Value.AXIS_Y, MAG_Value.AXIS_Z);
  
  (void) AccGyroMag_Update(&ACC_Value, &GYR_Value, &MAG_Value);
}

static void SendBattEnvData(void)
{
   int32_t decPart, intPart;
   int32_t PressToSend = 0;
   uint16_t BattToSend = 0u;
   int16_t RSSIToSend = 0, TempToSend = 0;
   int8_t rssi;
   uint16_t conn_handle;
   
   (void) HAL_ADC_Start(&hadc1);
        if (HAL_ADC_PollForConversion(&hadc1, 1000000u) == HAL_OK) {
            VBAT_Sense = HAL_ADC_GetValue(&hadc1);
            VBAT = (((VBAT_Sense * 3.3) / 4095) * (BAT_RUP + BAT_RDW)) / BAT_RDW;
            //PRINTF("Battery voltage = %fV\n\n", VBAT);
        }
    (void) HAL_ADC_Stop(&hadc1);
    
    MCR_BLUEMS_F2I_2D(press, intPart, decPart);
    PressToSend = intPart * 100 + decPart;
    MCR_BLUEMS_F2I_1D(((int32_t)((float32_t)VBAT * 100.0f) / 4.2f), intPart, decPart);
    BattToSend = intPart * 10 + decPart;
    if (BattToSend > 1000u) {
      BattToSend = 1000u;
    }
    MCR_BLUEMS_F2I_1D(temperature, intPart, decPart);
    TempToSend = intPart * 10 + decPart;
    
    (void)hci_read_rssi(&conn_handle, &rssi);
    RSSIToSend = (int16_t)rssi * 10;
    
    (void)Batt_Env_RSSI_Update(PressToSend, BattToSend, TempToSend, RSSIToSend);
}


static void SendArmingData(void)
{
	(void) ARMING_Update(rc_enable_motor);
}



/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */

/**
  * @}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
